title: Detect PowerShell Execution
id: 12345
status: stable

description: Detects suspicious PowerShell execution

author: Chaitra

date: 2026-07-09

logsource:
  product: windows
  service: sysmon

detection:
  selection:
    Image: "*powershell.exe"
  condition: selection

level: high